leftover-backend/app/controllers/application_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
---
  def authenticate_user
    auth_header = request.headers['Authorization']
    if auth_header
        account_id = AuthenticationTokenService.decode(auth_header.split(' ')[1])
        puts "account id of user #{account_id}"
        @account = Account.find(account_id)