leftover-backend/app/controllers/authentication_controller.rb

    def create
        account = Account.find_by(email: params.require(:email))
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = $1 LIMIT $2  [["email", "khalid.hamdaan@gmail.com"], ["LIMIT", 1]]