leftover-backend/app/controllers/item_controller.rb

    def index
        provider_profile_id = params.require(:providerProfile)

        items = Item.where(:provider_profile_id => provider_profile_id).all
---
SELECT "items".* FROM "items" WHERE "items"."provider_profile_id" = $1 LIMIT $2  [["provider_profile_id", nil], ["LIMIT", 1]]

    def show
        item = Item.find(params.require(:id))
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        provider_profile = @account.provider_employee_profile.provider_profile
        created_by = @account.provider_employee_profile

        food_bank_item = Item.new(
            {
                :name => params.require(:name),
                :description => params.require(:description),
                :units => params.require(:units),
                :unit_of_measurement => params.require(:unit_of_measurement),
                :amount_restriction => params.require(:amount_restriction),
                :item_expiration => params.require(:item_expiration),
                :published => true,
                :provider_profile_id => provider_profile.id,
                :created_by_id => created_by.id
            }
        )

        if food_bank_item.save
---
INSERT INTO "items" ("created_at", "updated_at", "provider_profile_id", "created_by_id", "name", "description", "units", "unit_of_measurement", "amount_restriction", "item_expiration", "published") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def update
        provider_employee = ProviderEmployeeProfile.find_by(account_id: @account.id)
        provider_profile = provider_employee.provider_profile
        to_update_item = Item.find(params.require(:id))
        if to_update_item.provider_profile == provider_profile

            to_update_item.update(item_update_params)
            to_update_item.update({
                :updated_by_id => provider_employee.id
            })
---
SELECT "provider_employee_profiles".* FROM "provider_employee_profiles" WHERE "provider_employee_profiles"."account_id" = $1 LIMIT $2  [["account_id", 59], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "items" SET "updated_at" = $1, "updated_by_id" = $2 WHERE "items"."id" = $3  [["updated_at", "2021-08-29 18:06:03.117882"], ["updated_by_id", 13], ["id", 5]]
UPDATE "items" SET "updated_at" = $1, "name" = $2 WHERE "items"."id" = $3  [["updated_at", "2021-08-29 18:06:03.105985"], ["name", "mangoes"], ["id", 5]]

    def unpublish
        provider_employee = ProviderEmployeeProfile.find_by(account_id: @account.id)
        provider_profile = provider_employee.provider_profile
        to_update_item = Item.find(params.require(:itemId))
        p provider_profile
        p to_update_item
        if to_update_item.provider_profile == provider_profile
            to_update_item.update({
                :published => false,
                :unpublished_by_id => provider_employee.id
            })
---
SELECT "provider_employee_profiles".* FROM "provider_employee_profiles" WHERE "provider_employee_profiles"."account_id" = $1 LIMIT $2  [["account_id", 59], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "items" SET "updated_at" = $1, "unpublished_by_id" = $2, "published" = $3 WHERE "items"."id" = $4  [["updated_at", "2021-08-29 01:53:29.520210"], ["unpublished_by_id", 13], ["published", false], ["id", 4]]