leftover-backend/app/controllers/provider_controller.rb

INSERT INTO "accounts" ("email", "password_digest", "type_of", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "khalid.hamdaan@gmail.com"], ["password_digest", "1234Augu"], ["type_of", "food_bank"], ["created_at", "2021-08-14 22:32:50.499051"], ["updated_at", "2021-08-14 22:32:50.499051"]]
INSERT INTO "provider_employee_profiles" ("is_admin", "first_name", "last_name", "created_at", "updated_at", "account_id", "provider_profile_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "provider_profiles" ("type_of", "address", "email", "phone", "approved_by_super_admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "provider_employee_profiles" ("is_admin", "created_at", "updated_at", "account_id", "provider_profile_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["is_admin", true], ["created_at", "2021-08-15 17:17:31.158813"], ["updated_at", "2021-08-15 17:17:31.158813"], ["account_id", 54], ["provider_profile_id", 53]]
---
  def create
    # Creates an account, Provider profile, and Provider Employee of type admin profile
    employee_profile = ProviderEmployeeProfile.create({
        :is_admin => true,
        :first_name => params.require(:name),
        :last_name => "Admin",
        :account_attributes => {
            :email => params.require(:email),
            :password => params.require(:password),
            :type_of => params.require(:type_of)
            },
        :provider_profile_attributes => {
            :name => params.require(:name),
            :type_of => params.require(:type_of),
            :address => params.require(:address),
            :email => params.require(:email),
            :phone => params.require(:phone),
            :approved_by_super_admin => false
    }})

    if employee_profile.save

SELECT "provider_employee_profiles".* FROM "provider_employee_profiles" WHERE "provider_employee_profiles"."account_id" = $1 LIMIT $2  [["account_id", 59], ["LIMIT", 1]]
SELECT "provider_profiles".* FROM "provider_profiles" WHERE "provider_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    p 'fuvkssss'
    p @account.provider_employee_profile
    provider = params.require(:id) != 'me' ? ProviderProfile.find(params.require(:id)) : @account.provider_employee_profile.provider_profile

SELECT "provider_employee_profiles".* FROM "provider_employee_profiles" WHERE "provider_employee_profiles"."account_id" = $1 LIMIT $2  [["account_id", 57], ["LIMIT", 1]]
SELECT "provider_profiles".* FROM "provider_profiles" WHERE "provider_profiles"."id" = $1 LIMIT $2  [["id", 54], ["LIMIT", 1]]
DELETE FROM "provider_profiles" WHERE "provider_profiles"."id" = $1  [["id", 54]]
---
  def destroy
    provider_employee = ProviderEmployeeProfile.find_by(account_id: @account.id);
    to_delete_profile_id = params[:id]
    if provider_employee.is_admin and provider_employee.provider_profile_id == to_delete_profile_id.to_i
      provider = ProviderProfile.find(params[:id])
      provider.destroy

SELECT "provider_employee_profiles".* FROM "provider_employee_profiles" WHERE "provider_employee_profiles"."account_id" = $1 LIMIT $2  [["account_id", 59], ["LIMIT", 1]]
SELECT "provider_profiles".* FROM "provider_profiles" WHERE "provider_profiles"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]
UPDATE "provider_profiles" SET "address" = $1, "updated_at" = $2 WHERE "provider_profiles"."id" = $3  [["address", "186 south front street columbus ohio 43215"], ["updated_at", "2021-08-26 03:18:43.240407"], ["id", 56]]
---
  def update
    provider_account = ProviderEmployeeProfile.find_by(account_id: @account.id);
    to_update_profile_id = params[:id]
    if provider_account.is_admin and provider_account.provider_profile_id == to_update_profile_id.to_i
      provider = ProviderProfile.find(to_update_profile_id)
      p provider_profile_params
      provider.update(provider_profile_params)